## Plan Result (dev_frontdoor)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pre-portal&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"
        name                                 = "sdshmcts-dev"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dev-trib-cicap" -> "healthProbeSettings-pre-portal"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/dev-trib-cicap"
          ~ load_balancing_name = "loadBalancingSettings-dev-trib-cicap" -> "loadBalancingSettings-pre-portal"
          ~ name                = "dev-trib-cicap" -> "pre-portal"

          ~ backend {
              ~ address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com" -> "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              ~ host_header = "dev.cicap.dsd.io" -> "pre-portal.dev.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-darts-portal" -> "healthProbeSettings-dev-trib-cicap"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/darts-portal"
          ~ load_balancing_name = "loadBalancingSettings-darts-portal" -> "loadBalancingSettings-dev-trib-cicap"
          ~ name                = "darts-portal" -> "dev-trib-cicap"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com" -> "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              ~ host_header = "darts-portal.dev.platform.hmcts.net" -> "dev.cicap.dsd.io"
                # (5 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-dev-trib-cicap"
          ~ name                = "healthProbeSettings-dev-trib-cicap" -> "healthProbeSettings-pre-portal"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-darts-portal"
          ~ name                = "healthProbeSettings-darts-portal" -> "healthProbeSettings-dev-trib-cicap"
            # (5 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = false
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-darts-portal"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/loadBalancingSettings/loadBalancingSettings-dev-trib-cicap"
          ~ name                            = "loadBalancingSettings-dev-trib-cicap" -> "loadBalancingSettings-pre-portal"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/loadBalancingSettings/loadBalancingSettings-darts-portal"
          ~ name                            = "loadBalancingSettings-darts-portal" -> "loadBalancingSettings-dev-trib-cicap"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-darts-portal"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "dev.cicap.dsd.io" -> "pre-portal.dev.platform.hmcts.net"
            id                                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/dev-trib-cicap"
          ~ name                                    = "dev-trib-cicap" -> "pre-portal"
          ~ web_application_firewall_policy_link_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcicapdev" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "darts-portal.dev.platform.hmcts.net" -> "dev.cicap.dsd.io"
            id                                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/darts-portal"
          ~ name                                    = "darts-portal" -> "dev-trib-cicap"
          ~ web_application_firewall_policy_link_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportaldev" -> "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcicapdev"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                               = "darts-portal.dev.platform.hmcts.net"
          + name                                    = "darts-portal"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportaldev"
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "dev-trib-cicap",
              + "pre-portal",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-trib-cicap"
          ~ name               = "dev-trib-cicap" -> "pre-portal"
            # (2 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "dev-trib-cicap" -> "pre-portal"
              ~ cache_enabled                         = true -> false
              ~ cache_query_parameter_strip_directive = "StripNone" -> "StripAll"
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "darts-portal",
              + "dev-trib-cicap",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/darts-portal"
          ~ name               = "darts-portal" -> "dev-trib-cicap"
            # (2 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "darts-portal" -> "dev-trib-cicap"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "toffee",
              + "darts-portal",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "darts-portal"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "darts-portal"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jd-bureau",
              + "toffee",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/jd-bureauHttpsRedirect"
          ~ name               = "jd-bureauHttpsRedirect" -> "toffeeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jd-public",
              + "jd-bureau",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/jd-publicHttpsRedirect"
          ~ name               = "jd-publicHttpsRedirect" -> "jd-bureauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-test-web",
              + "jd-public",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-test-webHttpsRedirect"
          ~ name               = "vh-test-webHttpsRedirect" -> "jd-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web",
              + "vh-test-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-webHttpsRedirect"
          ~ name               = "vh-video-webHttpsRedirect" -> "vh-test-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-reform",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-reformHttpsRedirect"
          ~ name               = "vh-video-web-reformHttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-pr-2057",
              + "vh-video-web-reform",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-pr-2057HttpsRedirect"
          ~ name               = "vh-video-web-pr-2057HttpsRedirect" -> "vh-video-web-reformHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-admin-web",
              + "vh-video-web-pr-2057",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-admin-webHttpsRedirect"
          ~ name               = "vh-admin-webHttpsRedirect" -> "vh-video-web-pr-2057HttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal-dev",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/portal-devHttpsRedirect"
          ~ name               = "portal-devHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-casetracker",
              + "portal-dev",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-casetrackerHttpsRedirect"
          ~ name               = "dev-casetrackerHttpsRedirect" -> "portal-devHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-certificatedbailiffs",
              + "dev-casetracker",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-certificatedbailiffsHttpsRedirect"
          ~ name               = "dev-certificatedbailiffsHttpsRedirect" -> "dev-casetrackerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-courtfines",
              + "dev-certificatedbailiffs",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-courtfinesHttpsRedirect"
          ~ name               = "dev-courtfinesHttpsRedirect" -> "dev-certificatedbailiffsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dev-immigrationappealsonline",
              + "dev-courtfines",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/dev-immigrationappealsonlineHttpsRedirect"
          ~ name               = "dev-immigrationappealsonlineHttpsRedirect" -> "dev-courtfinesHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "dev-immigrationappealsonline",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "dev-immigrationappealsonlineHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "darts-portal",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/darts-portalHttpsRedirect"
          ~ name               = "darts-portalHttpsRedirect" -> "sds-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pre-portal",
            ]
          + name               = "pre-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (121 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pre-portal"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/pre-portal"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pre-portal"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "preportaldev"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "CountryMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "GB",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "GeoMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932115"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942450"
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":534,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->